# Intro to Pandas
- [https://pandas.pydata.org/](https://pandas.pydata.org/)
- a fast, powerful, flexible and easy to use open source data analysis and manipulation tool built on Python

## What kind of data does pandas handle?

### pandas data table representation
![img](images/Pandas-Table.svg)
- to work with pandas package, must start with importing the package
- to install/update pandas you can use either conda or pip

```bash
conda install pandas
pip install pandas
```

In [5]:
import pandas as pd
import numpy as np

In [10]:
print(f'pandas version: {pd.__version__}')
print(f'numpy version: {np.__version__}')

pandas version: 1.2.0
numpy version: 1.19.1

## Series

- series is 1-d labeled array capable of holding any data type (integers, strings, float, Python objects, etc.)
- the axis labels are collective referred to as the **index**
- API to create Series:
```python
s = pd.Series(data, index=index)
```

- data can be:
    - NumPy's **ndarray**
    - Python dictionary
    - a scalar value (e.g. 5)
    - Python List
- index is a list of axis labels
    - index can be thought as row id or sample id
- if data is an ndarray, index must be the same length as data
    - if no index is passed, default index will be created [0, ..., len(data)-1]
- each column in the DataFrame is a Series

In [11]:
s = pd.Series(np.random.randn(5))

In [15]:
s

0    0.429609
1   -1.506708
2    0.024988
3   -0.232180
4   -0.090223
dtype: float64

In [16]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [17]:
s1 = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])

In [18]:
s1

a    0.481832
b   -1.421899
c   -0.208366
d   -0.274852
e    2.173727
dtype: float64

In [19]:
s1.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [20]:
# from dict
d = {"b": 1, "a": 0, "c": 2}
s2 = pd.Series(d)

In [21]:
s2

b    1
a    0
c    2
dtype: int64

In [34]:
# scalar value is repeated to match the length of index
s3 = pd.Series(5.0, index=["a", "b", "c", "d", "e"])

In [35]:
s3

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

In [72]:
# creating Series from Python List
s4 = pd.Series([1, 3, 5, np.nan, 6, 8])

In [73]:
s4

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

### Series is ndarray-like
- Series acts very similar to a ndarray, and is a valid argument to most NumPy functions
- slicing Series also slices the index

In [25]:
s1

a    0.481832
b   -1.421899
c   -0.208366
d   -0.274852
e    2.173727
dtype: float64

In [26]:
s1[0]

0.4818320827970079

In [27]:
s1[3:]

d   -0.274852
e    2.173727
dtype: float64

In [29]:
# slice using condition
s1[s1 > s1.median()]

a    0.481832
e    2.173727
dtype: float64

In [30]:
# slice using indices
s1[[4, 3, 1]]

e    2.173727
d   -0.274852
b   -1.421899
dtype: float64

In [37]:
# calculate the exponential (2*n) of each element n in the ndarray
# https://numpy.org/doc/stable/reference/generated/numpy.exp.html?highlight=exp#numpy.exp
np.exp2(s3)

a    32.0
b    32.0
c    32.0
d    32.0
e    32.0
dtype: float64

In [38]:
s3.dtype

dtype('float64')

### extract data array from Series
- extract just data as array without index

In [39]:
s3.array

<PandasArray>
[5.0, 5.0, 5.0, 5.0, 5.0]
Length: 5, dtype: float64

### convert series to ndarray

In [40]:
ndarr = s3.to_numpy()

In [41]:
ndarr

array([5., 5., 5., 5., 5.])

In [46]:
type(ndarr)

numpy.ndarray

In [45]:
ndarr.size

5

In [50]:
ndarr.shape

(5,)

### Series is dict-like
- use index as the key to get the corresponding value

In [51]:
s1['a']

0.4818320827970079

In [52]:
s3['e']

5.0

In [53]:
s3['e'] = 15.0

In [54]:
s3

a     5.0
b     5.0
c     5.0
d     5.0
e    15.0
dtype: float64

In [55]:
s3['g']

KeyError: 'g'

In [56]:
# use get with default value if key is missing
s3.get('g', np.nan)

nan

### Vectorized operations and label alignment with Series
- very similar to NumPy ndarray

In [57]:
s3

a     5.0
b     5.0
c     5.0
d     5.0
e    15.0
dtype: float64

In [58]:
s3+s3

a    10.0
b    10.0
c    10.0
d    10.0
e    30.0
dtype: float64

In [59]:
s3-s3

a    0.0
b    0.0
c    0.0
d    0.0
e    0.0
dtype: float64

In [60]:
s3*2

a    10.0
b    10.0
c    10.0
d    10.0
e    30.0
dtype: float64

In [61]:
s3/5

a    1.0
b    1.0
c    1.0
d    1.0
e    3.0
dtype: float64

In [63]:
# Series automatically aligns the data based on label
# if the label is not found in one Series or the other, the result will be marked as missing NaN
s3[1:] + s3[:-1]

a     NaN
b    10.0
c    10.0
d    10.0
e     NaN
dtype: float64

### Name attribute
- Series can also have a **name** atribute

In [64]:
s4 = pd.Series(np.random.randn(5), name="Some Name")

In [65]:
s4.name

'Some Name'

In [69]:
s4

0   -0.883347
1    0.722266
2    0.312205
3   -0.135596
4    0.168956
Name: Some Name, dtype: float64

In [70]:
# Series.rename creates a new Series with new name
s5 = s4.rename('New Name')

In [71]:
s5

0   -0.883347
1    0.722266
2    0.312205
3   -0.135596
4    0.168956
Name: New Name, dtype: float64

## DataFrame
- data table in pandas is called DataFrame
- Python dict can be used create DataFrame where keys will be used as column headers and the list of values as columns of the DataFrame
- each column of DataFrame is called `Series`

In [74]:
aDict = {
    "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth"
    ],
    "Age": [22, 35, 58],
    "Sex": ["male", "male", "female"]
}

In [75]:
df = pd.DataFrame(aDict)

In [76]:
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [77]:
df2 = pd.DataFrame(
{
    "A": 1.0,
    "B": pd.Timestamp("20130102"),
    "C": pd.Series(1, index=list(range(4)), dtype="float32"),
    "D": np.array([3] * 4, dtype="int32"),
    "E": pd.Categorical(["test", "train", "test", "train"]),
    "F": "foo",
})

In [78]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

### spreadsheet data
- the above df can be represented in a spreadsheet software
![SpreadSheet](./images/01_table_spreadsheet.png)

In [10]:
print(df)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [11]:
# just work with the data in column Age
df["Age"]

0    22
1    35
2    58
Name: Age, dtype: int64

In [79]:
df.Age

0    22
1    35
2    58
Name: Age, dtype: int64

In [13]:
# do something with dataframe
print(df.describe())

             Age
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000

In [14]:
print(df['Age'].max())

58

In [17]:
# print first 2 rows
print(df.head(2))

                       Name  Age   Sex
0   Braund, Mr. Owen Harris   22  male
1  Allen, Mr. William Henry   35  male

In [18]:
# print last 2 rows
print(df.tail(2))

                       Name  Age     Sex
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [19]:
df.dtypes

Name    object
Age      int64
Sex     object
dtype: object

## Read and write tabular data

![](./images/02_io_readwrite1.svg)

- use pandas `.read_*(fileName)` to read data from various formats
- Pandas raw data: [https://github.com/pandas-dev/pandas/tree/master/doc/data](https://github.com/pandas-dev/pandas/tree/master/doc/data)

In [80]:
# read CSV file directly from the Internet
iris_df = pd.read_csv('https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/iris.data')

In [81]:
iris_df.head()

   SepalLength  SepalWidth  PetalLength  PetalWidth         Name
0          5.1         3.5          1.4         0.2  Iris-setosa
1          4.9         3.0          1.4         0.2  Iris-setosa
2          4.7         3.2          1.3         0.2  Iris-setosa
3          4.6         3.1          1.5         0.2  Iris-setosa
4          5.0         3.6          1.4         0.2  Iris-setosa

In [84]:
iris_df.tail()

     SepalLength  SepalWidth  PetalLength  PetalWidth            Name
145          6.7         3.0          5.2         2.3  Iris-virginica
146          6.3         2.5          5.0         1.9  Iris-virginica
147          6.5         3.0          5.2         2.0  Iris-virginica
148          6.2         3.4          5.4         2.3  Iris-virginica
149          5.9         3.0          5.1         1.8  Iris-virginica

In [83]:
# technical summary of DataFrame
iris_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   SepalLength  150 non-null    float64
 1   SepalWidth   150 non-null    float64
 2   PetalLength  150 non-null    float64
 3   PetalWidth   150 non-null    float64
 4   Name         150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [87]:
iris_df.describe()

       SepalLength  SepalWidth  PetalLength  PetalWidth
count   150.000000  150.000000   150.000000  150.000000
mean      5.843333    3.054000     3.758667    1.198667
std       0.828066    0.433594     1.764420    0.763161
min       4.300000    2.000000     1.000000    0.100000
25%       5.100000    2.800000     1.600000    0.300000
50%       5.800000    3.000000     4.350000    1.300000
75%       6.400000    3.300000     5.100000    1.800000
max       7.900000    4.400000     6.900000    2.500000

### Titanic Dataset

- https://github.com/pandas-dev/pandas/blob/master/doc/data/titanic.csv

```
PassengerId: Id of every passenger.

Survived: This feature have value 0 and 1. 0 for not survived and 1 for survived.

Pclass: There are 3 classes: Class 1, Class 2 and Class 3.

Name: Name of passenger.

Sex: Gender of passenger.

Age: Age of passenger.

SibSp: Indication that passenger have siblings and spouse.

Parch: Whether a passenger is alone or have family.

Ticket: Ticket number of passenger.

Fare: Indicating the fare.

Cabin: The cabin of passenger.

Embarked: The embarked category.
```

In [21]:
# let's read titanic.csv file
titanicDf = pd.read_csv('data/titanic.csv')

In [23]:
print(titanicDf)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [24]:
# print first 8 rows
print(titanicDf.head(8))

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3
5            6         0       3
6            7         0       1
7            8         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0
5                                   Moran, Mr. James    male   NaN      0
6                            McCarthy, Mr. Timothy J    male  54.0      0
7                     Palsson, Master. Gosta Leonard    male   2.0      3

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
5      0            330877   8.4583   NaN        Q
6      0             17463  51.8625   E46        S
7      1            349909  21.0750   NaN        S

In [25]:
titanicDf.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

### write the DataFrame as Excel file

- need openpyxl library

```bash
conda install openpyxl
```

In [27]:
titanicDf.to_excel('data/titanic.xlsx', sheet_name='passengers')

In [28]:
# technical summary of DataFrame
titanicDf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## select a subset of a DataFrame

![](./images/03_subset_columns.svg)

In [29]:
# copy just the Age column or Series
ages = titanicDf['Age']

In [30]:
type(ages)

pandas.core.series.Series

In [31]:
ages.shape

(891,)

In [32]:
# get age and sex columns
age_sex = titanicDf[['Age', 'Sex']]

In [34]:
print(age_sex.head())

    Age     Sex
0  22.0    male
1  38.0  female
2  26.0  female
3  35.0  female
4  35.0    male

In [35]:
age_sex.shape

(891, 2)

In [36]:
# passengers older than 35
titanicDf['Age'] > 35

0      False
1       True
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [37]:
# Create the Df with selection
passengers = titanicDf[titanicDf['Age']>35]

In [40]:
print(passengers.describe)

<bound method NDFrame.describe of      PassengerId  Survived  Pclass  \
1              2         1       1
6              7         0       1
11            12         1       1
13            14         0       3
15            16         1       2
..           ...       ...     ...
865          866         1       2
871          872         1       1
873          874         0       3
879          880         1       1
885          886         0       3

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
6                              McCarthy, Mr. Timothy J    male  54.0      0
11                            Bonnell, Miss. Elizabeth  female  58.0      0
13                         Andersson, Mr. Anders Johan    male  39.0      1
15                    Hewlett, Mrs. (Mary D Kingcome)   female  55.0      0
..                                                 ...     ...   ...    ...
865                           Bystrom, Mrs. (Karolina)  female  42.0      0
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female  47.0      1
873                        Vander Cruyssen, Mr. Victor    male  47.0      0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0
885               Rice, Mrs. William (Margaret Norton)  female  39.0      0

     Parch    Ticket     Fare Cabin Embarked
1        0  PC 17599  71.2833   C85        C
6        0     17463  51.8625   E46        S
11       0    113783  26.5500  C103        S
13       5    347082  31.2750   NaN        S
15       0    248706  16.0000   NaN        S
..     ...       ...      ...   ...      ...
865      0    236852  13.0000   NaN        S
871      1     11751  52.5542   D35        S
873      0    345765   9.0000   NaN        S
879      1     11767  83.1583   C50        C
885      5    382652  29.1250   NaN        Q

[217 rows x 12 columns]>

In [43]:
# another example of selection
class_23 = titanicDf[titanicDf["Pclass"].isin([2, 3])]

In [45]:
print(class_23.head())

   PassengerId  Survived  Pclass                            Name     Sex  \
0            1         0       3         Braund, Mr. Owen Harris    male
2            3         1       3          Heikkinen, Miss. Laina  female
4            5         0       3        Allen, Mr. William Henry    male
5            6         0       3                Moran, Mr. James    male
7            8         0       3  Palsson, Master. Gosta Leonard    male

    Age  SibSp  Parch            Ticket     Fare Cabin Embarked
0  22.0      1      0         A/5 21171   7.2500   NaN        S
2  26.0      0      0  STON/O2. 3101282   7.9250   NaN        S
4  35.0      0      0            373450   8.0500   NaN        S
5   NaN      0      0            330877   8.4583   NaN        Q
7   2.0      3      1            349909  21.0750   NaN        S

In [47]:
# select data where age is known
age_no_na = titanicDf[titanicDf['Age'].notna()]

In [49]:
print(age_no_na.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In [50]:
age_no_na.shape

(714, 12)

In [53]:
# select passengers names older than 35 years
adult_names = titanicDf.loc[titanicDf['Age'] > 35, 'Name']

In [54]:
adult_names.head()

1     Cumings, Mrs. John Bradley (Florence Briggs Th...
6                               McCarthy, Mr. Timothy J
11                             Bonnell, Miss. Elizabeth
13                          Andersson, Mr. Anders Johan
15                     Hewlett, Mrs. (Mary D Kingcome)
Name: Name, dtype: object

In [56]:
# select rows 10-25 and columns 3-5
print(titanicDf.iloc[9:25, 2:5])

    Pclass                                               Name     Sex
9        2                Nasser, Mrs. Nicholas (Adele Achem)  female
10       3                    Sandstrom, Miss. Marguerite Rut  female
11       1                           Bonnell, Miss. Elizabeth  female
12       3                     Saundercock, Mr. William Henry    male
13       3                        Andersson, Mr. Anders Johan    male
14       3               Vestrom, Miss. Hulda Amanda Adolfina  female
15       2                   Hewlett, Mrs. (Mary D Kingcome)   female
16       3                               Rice, Master. Eugene    male
17       2                       Williams, Mr. Charles Eugene    male
18       3  Vander Planke, Mrs. Julius (Emelia Maria Vande...  female
19       3                            Masselmani, Mrs. Fatima  female
20       2                               Fynney, Mr. Joseph J    male
21       2                              Beesley, Mr. Lawrence    male
22       3                        McGowan, Miss. Anna "Annie"  female
23       1                       Sloper, Mr. William Thompson    male
24       3                      Palsson, Miss. Torborg Danira  female

## updating selected elements with iloc
- update first 3 names to "anonymous"

In [57]:
titanicDf.iloc[0:3, 3] = "anonymous"

In [58]:
titanicDf.head()['Name']

0                                       anonymous
1                                       anonymous
2                                       anonymous
3    Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                        Allen, Mr. William Henry
Name: Name, dtype: object

## creating new columns derived from existing columns

![](./images/05_newcolumn_1.svg)

## OpenAQ API
- http://dhhagan.github.io/py-openaq/tutorial/api.html#openaq-api
https://py-openaq.readthedocs.io/en/latest/

```bash
pip install py-openaq
```

### Let's use air quality data provided by OpenAQ API

In [60]:
import openaq

In [62]:
api = openaq.OpenAQ()

In [63]:
pollutionDF = api.cities(df=True, limit=1000)

/Users/rbasnet/miniconda3/envs/ml/lib/python3.7/site-packages/openaq/decorators.py:57: FutureWarning: pandas.io.json.json_normalize is deprecated, use pandas.json_normalize instead
  data = pd.io.json.json_normalize(resp)

In [64]:
pollutionDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1000 non-null   object
 1   name       1000 non-null   object
 2   city       1000 non-null   object
 3   count      1000 non-null   int64
 4   locations  1000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 39.2+ KB

In [65]:
print(pollutionDF.head())

  country                name                city   count  locations
0      AD  Escaldes-Engordany  Escaldes-Engordany  204662          2
1      AD              unused              unused   16301          1
2      AE           Abu Dhabi           Abu Dhabi  436140          1
3      AE               Dubai               Dubai  433111          1
4      AE                 N/A                 N/A   48205          2

In [68]:
pollutionDF['pollution_per100'] = pollutionDF['count']/100

In [71]:
print(pollutionDF.head())

  country                name                city   count  locations  \
0      AD  Escaldes-Engordany  Escaldes-Engordany  204662          2
1      AD              unused              unused   16301          1
2      AE           Abu Dhabi           Abu Dhabi  436140          1
3      AE               Dubai               Dubai  433111          1
4      AE                 N/A                 N/A   48205          2

   pollution_per100
0           2046.62
1            163.01
2           4361.40
3           4331.11
4            482.05

In [76]:
# rename column headers
renamedDF = pollutionDF.rename(
    columns={
        'country': 'C_Code',
        'name' : 'C_Name',
    }
)

In [75]:
# see all the column names
pollutionDF.columns

Index(['country', 'name', 'city', 'count', 'locations', 'pollution_per100'], dtype='object')

In [77]:
renamedDF.columns

Index(['C_Code', 'C_Name', 'city', 'count', 'locations', 'pollution_per100'], dtype='object')

In [79]:
print(renamedDF.head())

  C_Code              C_Name                city   count  locations  \
0     AD  Escaldes-Engordany  Escaldes-Engordany  204662          2
1     AD              unused              unused   16301          1
2     AE           Abu Dhabi           Abu Dhabi  436140          1
3     AE               Dubai               Dubai  433111          1
4     AE                 N/A                 N/A   48205          2

   pollution_per100
0           2046.62
1            163.01
2           4361.40
3           4331.11
4            482.05

## Combine data from multiple tables
- `pd.concat()` performs concatenatoins operations of multiple tables along one of the axis (row-wise or column-wise)
- typically row-wise concatenation is a common operation

![](./images/08_concat_row1.svg)

In [80]:
# make a deep copy of dataframe/table
renamedDF1 = renamedDF.copy(deep=True)

In [82]:
print(renamedDF1.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   C_Code            1000 non-null   object
 1   C_Name            1000 non-null   object
 2   city              1000 non-null   object
 3   count             1000 non-null   int64
 4   locations         1000 non-null   int64
 5   pollution_per100  1000 non-null   float64
dtypes: float64(1), int64(2), object(3)
memory usage: 47.0+ KB
None

In [83]:
# let's concatenate the two into a single table
combinedDF = pd.concat([renamedDF, renamedDF1], axis=0)

In [84]:
combinedDF.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   C_Code            2000 non-null   object
 1   C_Name            2000 non-null   object
 2   city              2000 non-null   object
 3   count             2000 non-null   int64
 4   locations         2000 non-null   int64
 5   pollution_per100  2000 non-null   float64
dtypes: float64(1), int64(2), object(3)
memory usage: 109.4+ KB

## join tables using a common identifier
- merge tables column-wise; a left-join

![](./images/08_merge_left.svg)

In [104]:
no2_url = 'https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/air_quality_no2_long.csv'
pm2_url = 'https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/air_quality_pm25_long.csv'
air_quality_stations_url = 'https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/air_quality_stations.csv'
air_qual_parameters_url = 'https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/air_quality_parameters.csv'

In [86]:
air_quality_no2 = pd.read_csv(no2_url)

In [88]:
print(air_quality_no2.head())

    city country                   date.utc location parameter  value   unit
0  Paris      FR  2019-06-21 00:00:00+00:00  FR04014       no2   20.0  g/m
1  Paris      FR  2019-06-20 23:00:00+00:00  FR04014       no2   21.8  g/m
2  Paris      FR  2019-06-20 22:00:00+00:00  FR04014       no2   26.5  g/m
3  Paris      FR  2019-06-20 21:00:00+00:00  FR04014       no2   24.9  g/m
4  Paris      FR  2019-06-20 20:00:00+00:00  FR04014       no2   21.4  g/m

In [94]:
air_quality_parameters = pd.read_csv(air_qual_parameters_url)

In [95]:
print(air_quality_parameters.head())

     id                                        description  name
0    bc                                       Black Carbon    BC
1    co                                    Carbon Monoxide    CO
2   no2                                   Nitrogen Dioxide   NO2
3    o3                                              Ozone    O3
4  pm10  Particulate matter less than 10 micrometers in...  PM10

In [98]:
# column parameter in no2 table and id in parameters are common
air_quality = pd.merge(air_quality_no2, air_quality_parameters, how='left', left_on='parameter', right_on='id')

In [103]:
print(air_quality.head(10))

    city country                   date.utc location parameter  value   unit  \
0  Paris      FR  2019-06-21 00:00:00+00:00  FR04014       no2   20.0  g/m
1  Paris      FR  2019-06-20 23:00:00+00:00  FR04014       no2   21.8  g/m
2  Paris      FR  2019-06-20 22:00:00+00:00  FR04014       no2   26.5  g/m
3  Paris      FR  2019-06-20 21:00:00+00:00  FR04014       no2   24.9  g/m
4  Paris      FR  2019-06-20 20:00:00+00:00  FR04014       no2   21.4  g/m
5  Paris      FR  2019-06-20 19:00:00+00:00  FR04014       no2   25.3  g/m
6  Paris      FR  2019-06-20 18:00:00+00:00  FR04014       no2   23.9  g/m
7  Paris      FR  2019-06-20 17:00:00+00:00  FR04014       no2   23.2  g/m
8  Paris      FR  2019-06-20 16:00:00+00:00  FR04014       no2   19.0  g/m
9  Paris      FR  2019-06-20 15:00:00+00:00  FR04014       no2   19.3  g/m

    id       description name
0  no2  Nitrogen Dioxide  NO2
1  no2  Nitrogen Dioxide  NO2
2  no2  Nitrogen Dioxide  NO2
3  no2  Nitrogen Dioxide  NO2
4  no2  Nitrogen Dioxide  NO2
5  no2  Nitrogen Dioxide  NO2
6  no2  Nitrogen Dioxide  NO2
7  no2  Nitrogen Dioxide  NO2
8  no2  Nitrogen Dioxide  NO2
9  no2  Nitrogen Dioxide  NO2

In [102]:
print(air_quality.tail(10))

        city country                   date.utc            location parameter  \
2058  London      GB  2019-05-07 11:00:00+00:00  London Westminster       no2
2059  London      GB  2019-05-07 10:00:00+00:00  London Westminster       no2
2060  London      GB  2019-05-07 09:00:00+00:00  London Westminster       no2
2061  London      GB  2019-05-07 08:00:00+00:00  London Westminster       no2
2062  London      GB  2019-05-07 07:00:00+00:00  London Westminster       no2
2063  London      GB  2019-05-07 06:00:00+00:00  London Westminster       no2
2064  London      GB  2019-05-07 04:00:00+00:00  London Westminster       no2
2065  London      GB  2019-05-07 03:00:00+00:00  London Westminster       no2
2066  London      GB  2019-05-07 02:00:00+00:00  London Westminster       no2
2067  London      GB  2019-05-07 01:00:00+00:00  London Westminster       no2

      value   unit   id       description name
2058   21.0  g/m  no2  Nitrogen Dioxide  NO2
2059   21.0  g/m  no2  Nitrogen Dioxide  NO2
2060   28.0  g/m  no2  Nitrogen Dioxide  NO2
2061   32.0  g/m  no2  Nitrogen Dioxide  NO2
2062   32.0  g/m  no2  Nitrogen Dioxide  NO2
2063   26.0  g/m  no2  Nitrogen Dioxide  NO2
2064   16.0  g/m  no2  Nitrogen Dioxide  NO2
2065   19.0  g/m  no2  Nitrogen Dioxide  NO2
2066   19.0  g/m  no2  Nitrogen Dioxide  NO2
2067   23.0  g/m  no2  Nitrogen Dioxide  NO2